/*-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
    武器データ持ったボタンクラス
  -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-*/
phina.define("Attack_button",
  {
    /*---=---=---=---=---=---=---=---=---=---=---=---=---=---=---=---
        コンストラクタ
      ---=---=---=---=---=---=---=---=---=---=---=---=---=---=---=---*/
    superClass: "phina.ui.Button",
    init: function (weapon, id, option)
    {
      this.superInit(option);
      this.武器 = weapon;
      this.ID = id;

      let damage = "";
      for (let i = 0; i < weapon.攻撃力.ダイス.length; i++)
      {
        damage += weapon.攻撃力.ダイス[i][0] + "d" + weapon.攻撃力.ダイス[i][1];
        if (i < weapon.攻撃力.ダイス.length - 1) damage += "+";
      }
      if (weapon.攻撃力.固定値 > 0) damage += "+" + weapon.攻撃力.固定値;

      this.text = weapon.名前 + " " + damage;
    }
    /*---=---=---=---=---=---=---=---=---=---=---=---=---=---=---=---*/
  });
/*-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-*/

